examples/fitting_parameters_from_covered_interface/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object controlDict;
}
    startFrom latestTime;
    startTime 0;
    stopAt endTime;
    endTime 2.0;
    //*** Adjustable runtime controls ***
    writeControl adjustableRunTime;
    adjustTimeStep yes;
    maxCo 0.1;
    deltaT 0.01;
    writeInterval 0.01;
    //***
    purgeWrite 0;
    writeFormat binary;
    writePrecision 16;
    writeCompression uncompressed;
    timeFormat general;
    timePrecision 6;
    graphFormat raw;
    runTimeModifiable true;

libs (
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
      "libswakSourceFields.so"
     );
